import { Injectable } from '@angular/core';

@Injectable({
  providedIn: 'root'
})
export class DataService {
  apiPJ="http://localhost/projectwebapi"
  menu:any

  colorMain="#86469C"
  colorBC="#BC7FCD"
  colorsub1="#FB9AD1"
  colorsub2="#FFCDEA"

  dataT = [
    { T: "Kyorugi", data: 'ยุวชน ชาย อายุไม่เกิน 6 ปี(พ.ศ. 2560 เป็นต้นไป)' },
    { T: "Kyorugi", data: 'ยุวชน ชาย อายุ7 - 8 ปี(พ.ศ. 2558-2559)' },
    { T: "Kyorugi", data: 'ยุวชน ชาย อายุ9 - 10 ปี(พ.ศ.2556-2557)' },
    { T: "Kyorugi", data: 'ยุวชน ชาย อายุ11 - 12 ปี(พ.ศ. 2554-2555)' },
    { T: "Kyorugi", data: 'ยุวชน ชาย - หญิง อายุ12 - 14 ปี(พ.ศ. 2552-2554)' },
    { T: "Kyorugi", data: 'เยาวชน ชาย อายุ15 - 17 ปี(พ.ศ. 2549-2551)' },
    { T: "Kyorugi", data: 'ประชาชนชาย - หญิง 18 ปีขึ้นไป (พ.ศ. 2548)' },
    { T: "Kyorugi", data: 'ยุวชน หญิง อายุไม่เกิน 6 ปี(พ.ศ. 2560 เป็นต้นไป)' },
    { T: "Kyorugi", data: 'ยุวชน หญิง อายุ7 - 8 ปี(พ.ศ. 2558-2559)' },
    { T: "Kyorugi", data: 'ยุวชน หญิง อายุ9 - 10 ปี(พ.ศ.2556-2557)' },
    { T: "Kyorugi", data: 'ยุวชน หญิง อายุ11 - 12 ปี(พ.ศ. 2554-2555)' },
    { T: "Kyorugi", data: 'ยุวชน หญิง อายุ12 - 14 ปี(พ.ศ. 2552-2554)' },
    { T: "Kyorugi", data: 'เยาวชน หญิง อายุ15 - 17 ปี(พ.ศ. 2549-2551)' },
    { T: "Kyorugi", data: 'ประชาชนหญิง - หญิง 18 ปีขึ้นไป (พ.ศ. 2548)' },
    { T: "Poomsae", data: 'สายขาว' },
    { T: "Poomsae", data: 'สายเหลือง' },
    { T: "Poomsae", data: 'สายเขียว' },
    { T: "Poomsae", data: 'สายฟ้า' },
    { T: "Poomsae", data: 'สายน้ำตาล' },
    { T: "Poomsae", data: 'สายแดง' },
    { T: "Poomsae", data: 'สายดำ' },
  ];

  dataT1 = [
    { T: "Kyorugi : ยุวชน ชาย อายุไม่เกิน 6 ปี(พ.ศ. 2560 เป็นต้นไป)" },
    { T: "Kyorugi : ยุวชน ชาย อายุ7 - 8 ปี(พ.ศ. 2558-2559)" },
    { T: "Kyorugi : ยุวชน ชาย อายุ9 - 10 ปี(พ.ศ.2556-2557)" },
    { T: "Kyorugi : ยุวชน ชาย อายุ11 - 12 ปี(พ.ศ. 2554-2555)" },
    { T: "Kyorugi : ยุวชน ชาย - หญิง อายุ12 - 14 ปี(พ.ศ. 2552-2554)"},
    { T: "Kyorugi : เยาวชน ชาย อายุ15 - 17 ปี(พ.ศ. 2549-2551)" },
    { T: "Kyorugi : ประชาชนชาย - หญิง 18 ปีขึ้นไป (พ.ศ. 2548)" },
    { T: "Kyorugi : ยุวชน หญิง อายุไม่เกิน 6 ปี(พ.ศ. 2560 เป็นต้นไป)" },
    { T: "Kyorugi : ยุวชน หญิง อายุ7 - 8 ปี(พ.ศ. 2558-2559)" },
    { T: "Kyorugi : ยุวชน หญิง อายุ9 - 10 ปี(พ.ศ.2556-2557)" },
    { T: "Kyorugi : ยุวชน หญิง อายุ11 - 12 ปี(พ.ศ. 2554-2555)" },
    { T: "Kyorugi : ยุวชน หญิง อายุ12 - 14 ปี(พ.ศ. 2552-2554)" },
    { T: "Kyorugi : เยาวชน หญิง อายุ15 - 17 ปี(พ.ศ. 2549-2551)" },
    { T: "Kyorugi : ประชาชนหญิง - หญิง 18 ปีขึ้นไป (พ.ศ. 2548)" },
    { T: "Poomsae : สายขาว" },
    { T: "Poomsae : สายเหลือง" },
    { T: "Poomsae : สายเขียว" },
    { T: "Poomsae : สายฟ้า" },
    { T: "Poomsae : สายน้ำตาล" },
    { T: "Poomsae : สายแดง" },
    { T: "Poomsae : สายดำ" },
  ];

  constructor() {
    if(this.menu == undefined)
      {
        this.menu = this.menu || 1;

      }

  }
}
